src/jmeter-report/statistics.json
{
  "GET /material-groups" : {
    "transaction" : "GET /material-groups",
    "sampleCount" : 2460,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 21.032520325203226,
    "medianResTime" : 26.0,
    "minResTime" : 3.0,
    "maxResTime" : 63.0,
    "pct1ResTime" : 34.0,
    "pct2ResTime" : 36.0,
    "pct3ResTime" : 41.0,
    "throughput" : 41.70339730114599,
    "receivedKBytesPerSec" : 21.788396050891706,
    "sentKBytesPerSec" : 15.394418144368347
  },
  "GET /materials (burst)" : {
    "transaction" : "GET /materials (burst)",
    "sampleCount" : 100,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 11.160000000000002,
    "medianResTime" : 10.0,
    "minResTime" : 8.0,
    "maxResTime" : 40.0,
    "pct1ResTime" : 14.0,
    "pct2ResTime" : 23.849999999999966,
    "pct3ResTime" : 39.949999999999974,
    "throughput" : 100.20040080160321,
    "receivedKBytesPerSec" : 110.96411573146293,
    "sentKBytesPerSec" : 37.18374248496994
  },
  "GET /formula-groups" : {
    "transaction" : "GET /formula-groups",
    "sampleCount" : 2451,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 21.23500611995108,
    "medianResTime" : 26.0,
    "minResTime" : 3.0,
    "maxResTime" : 63.0,
    "pct1ResTime" : 34.0,
    "pct2ResTime" : 36.0,
    "pct3ResTime" : 41.0,
    "throughput" : 41.70495150587034,
    "receivedKBytesPerSec" : 21.00792482878169,
    "sentKBytesPerSec" : 15.354264372766718
  },
  "POST /auth/login" : {
    "transaction" : "POST /auth/login",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 686.0,
    "medianResTime" : 686.0,
    "minResTime" : 686.0,
    "maxResTime" : 686.0,
    "pct1ResTime" : 686.0,
    "pct2ResTime" : 686.0,
    "pct3ResTime" : 686.0,
    "throughput" : 1.4577259475218658,
    "receivedKBytesPerSec" : 1.2142971027696792,
    "sentKBytesPerSec" : 0.3160304300291545
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 14618,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 56.565604049801664,
    "medianResTime" : 29.0,
    "minResTime" : 3.0,
    "maxResTime" : 686.0,
    "pct1ResTime" : 240.0,
    "pct2ResTime" : 285.0,
    "pct3ResTime" : 377.0,
    "throughput" : 158.8308795566904,
    "receivedKBytesPerSec" : 131.14833818316401,
    "sentKBytesPerSec" : 55.39833690987125
  },
  "POST /auth/login (stress)" : {
    "transaction" : "POST /auth/login (stress)",
    "sampleCount" : 2161,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 256.7334567329943,
    "medianResTime" : 264.0,
    "minResTime" : 112.0,
    "maxResTime" : 463.0,
    "pct1ResTime" : 359.79999999999995,
    "pct2ResTime" : 381.0,
    "pct3ResTime" : 404.3800000000001,
    "throughput" : 71.5089344804765,
    "receivedKBytesPerSec" : 59.55344401472535,
    "sentKBytesPerSec" : 15.502913529947055
  },
  "GET /calculations" : {
    "transaction" : "GET /calculations",
    "sampleCount" : 2471,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 22.386887899635763,
    "medianResTime" : 27.0,
    "minResTime" : 4.0,
    "maxResTime" : 69.0,
    "pct1ResTime" : 35.0,
    "pct2ResTime" : 38.0,
    "pct3ResTime" : 42.0,
    "throughput" : 41.701122268163026,
    "receivedKBytesPerSec" : 45.16264120643827,
    "sentKBytesPerSec" : 15.271407080626107
  },
  "GET /materials" : {
    "transaction" : "GET /materials",
    "sampleCount" : 2492,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 22.729133226324212,
    "medianResTime" : 28.0,
    "minResTime" : 4.0,
    "maxResTime" : 151.0,
    "pct1ResTime" : 36.0,
    "pct2ResTime" : 38.0,
    "pct3ResTime" : 44.0,
    "throughput" : 41.646472918094155,
    "receivedKBytesPerSec" : 46.120215126092546,
    "sentKBytesPerSec" : 15.739438495412536
  },
  "GET /formulas" : {
    "transaction" : "GET /formulas",
    "sampleCount" : 2482,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 21.9689766317486,
    "medianResTime" : 27.0,
    "minResTime" : 3.0,
    "maxResTime" : 67.0,
    "pct1ResTime" : 35.0,
    "pct2ResTime" : 37.0,
    "pct3ResTime" : 42.0,
    "throughput" : 41.72550601842512,
    "receivedKBytesPerSec" : 37.039536104246515,
    "sentKBytesPerSec" : 15.728559885851658
  }
}